Тестовая_база_ERP_14/src/InformationRegisters/ГрафикНачисленийЛизинга/ГрафикНачисленийЛизинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикНачисленийЛизинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>УслугаПоЛизингу</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЗачетОбеспечительногоПлатежа</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВыкупПредметаЛизинга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>УслугаПоЛизингуИтог</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЗачетОбеспечительногоПлатежаИтог</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВыкупПредметаЛизингаИтог</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>ВариантГрафика</name>
    <type>
      <types>CatalogRef.ВариантыГрафиковЛизинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ГрафикНачисленийЛизинга/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	УслугаПоЛизингуИтог = 0; ЗачетОбеспечительногоПлатежаИтог = 0; ВыкупПредметаЛизингаИтог = 0;
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		УслугаПоЛизингуИтог = УслугаПоЛизингуИтог + СтрокаНабора.УслугаПоЛизингу;
		СтрокаНабора.УслугаПоЛизингуИтог = УслугаПоЛизингуИтог;
		
		ЗачетОбеспечительногоПлатежаИтог = ЗачетОбеспечительногоПлатежаИтог + СтрокаНабора.ЗачетОбеспечительногоПлатежа;
		СтрокаНабора.ЗачетОбеспечительногоПлатежаИтог = ЗачетОбеспечительногоПлатежаИтог;
		
		ВыкупПредметаЛизингаИтог = ВыкупПредметаЛизингаИтог + СтрокаНабора.ВыкупПредметаЛизинга;
		СтрокаНабора.ВыкупПредметаЛизингаИтог = ВыкупПредметаЛизингаИтог;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			ЗаполнитьЗначенияСвойств(СтрокаНабора,ДанныеЗаполнения);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
